```tf

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:                                                          + create                                                                                                                                                                                                                                                                                                                                                                                          Terraform will perform the following actions:                                                                                                                                                                                                                                                                                                                                                         # module.landing-dns-pub-cg.google_dns_managed_zone.dns_managed_zone[0] will be created                                                                                                           + resource "google_dns_managed_zone" "dns_managed_zone" {                                                                                                                                             + creation_time    = (known after apply)                                                                                                                                                          + description      = "Terraform managed."                                                                                                                                                         + dns_name         = "cg.tentwentyone.io."                                                                                                                                                        + effective_labels = {                                                                                                                                                                                + "goog-terraform-provisioned" = "true"                                                                                                                                                         }                                                                                                                                                                                               + force_destroy    = false                                                                                                                                                                        + id               = (known after apply)                                                                                                                                                          + managed_zone_id  = (known after apply)                                                                                                                                                          + name             = "cg-tentwentyone-io"                                                                                                                                                         + name_servers     = (known after apply)                                                                                                                                                          + project          = "ten21-prod-net-landing-0"                                                                                                                                                   + reverse_lookup   = false                                                                                                                                                                        + terraform_labels = {                                                                                                                                                                                + "goog-terraform-provisioned" = "true"                                                                                                                                                         }                                                                                                                                                                                               + visibility       = "public"                                                                                                                                                                                                                                                                                                                                                                       + cloud_logging_config {                                                                                                                                                                              + enable_logging = false                                                                                                                                                                        }                                                                                                                                                                                                                                                                                                                                                                                                 + dnssec_config (known after apply)                                                                                                                                                             }                                                                                                                                                                                                                                                                                                                                                                                               Plan: 1 to add, 0 to change, 0 to destroy.   

```